modm-ext/data.modm.io/docs/svd/header_stm32wba52xx.svd
        <register>
          <name>PRIVCFGR</name>
          <description>FLASH privilege configuration register</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SPRIV</name>
              <description>Privilege protection for secure registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NSPRIV</name>
              <description>Privilege protection for non-secure registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVBBR1</name>
          <description>FLASH privilege block-based bank register 1</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRIVBB0</name>
              <description>Page 0 in Flash only accessible by privileged access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB1</name>
              <description>Page 1 in Flash only accessible by privileged access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB2</name>
              <description>Page 2 in Flash only accessible by privileged access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB3</name>
              <description>Page 3 in Flash only accessible by privileged access</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB4</name>
              <description>Page 4 in Flash only accessible by privileged access</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB5</name>
              <description>Page 5 in Flash only accessible by privileged access</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB6</name>
              <description>Page 6 in Flash only accessible by privileged access</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB7</name>
              <description>Page 7 in Flash only accessible by privileged access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB8</name>
              <description>Page 8 in Flash only accessible by privileged access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB9</name>
              <description>Page 9 in Flash only accessible by privileged access</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB10</name>
              <description>Page 10 in Flash only accessible by privileged access</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB11</name>
              <description>Page 11 in Flash only accessible by privileged access</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB12</name>
              <description>Page 12 in Flash only accessible by privileged access</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB13</name>
              <description>Page 13 in Flash only accessible by privileged access</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB14</name>
              <description>Page 14 in Flash only accessible by privileged access</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB15</name>
              <description>Page 15 in Flash only accessible by privileged access</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB16</name>
              <description>Page 16 in Flash only accessible by privileged access</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB17</name>
              <description>Page 17 in Flash only accessible by privileged access</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB18</name>
              <description>Page 18 in Flash only accessible by privileged access</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB19</name>
              <description>Page 19 in Flash only accessible by privileged access</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB20</name>
              <description>Page 20 in Flash only accessible by privileged access</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB21</name>
              <description>Page 21 in Flash only accessible by privileged access</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB22</name>
              <description>Page 22 in Flash only accessible by privileged access</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB23</name>
              <description>Page 23 in Flash only accessible by privileged access</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB24</name>
              <description>Page 24 in Flash only accessible by privileged access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB25</name>
              <description>Page 25 in Flash only accessible by privileged access</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB26</name>
              <description>Page 26 in Flash only accessible by privileged access</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB27</name>
              <description>Page 27 in Flash only accessible by privileged access</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB28</name>
              <description>Page 28 in Flash only accessible by privileged access</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB29</name>
              <description>Page 29 in Flash only accessible by privileged access</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB30</name>
              <description>Page 30 in Flash only accessible by privileged access</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB31</name>
              <description>Page 31 in Flash only accessible by privileged access</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRIVBBR2</name>
          <description>FLASH privilege block-based bank register 2</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PRIVBB0</name>
              <description>Page 32 in Flash only accessible by privileged access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB1</name>
              <description>Page 33 in Flash only accessible by privileged access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB2</name>
              <description>Page 34 in Flash only accessible by privileged access</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB3</name>
              <description>Page 35 in Flash only accessible by privileged access</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB4</name>
              <description>Page 36 in Flash only accessible by privileged access</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB5</name>
              <description>Page 37 in Flash only accessible by privileged access</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB6</name>
              <description>Page 38 in Flash only accessible by privileged access</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB7</name>
              <description>Page 39 in Flash only accessible by privileged access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB8</name>
              <description>Page 40 in Flash only accessible by privileged access</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB9</name>
              <description>Page 41 in Flash only accessible by privileged access</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB10</name>
              <description>Page 42 in Flash only accessible by privileged access</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB11</name>
              <description>Page 43 in Flash only accessible by privileged access</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB12</name>
              <description>Page 44 in Flash only accessible by privileged access</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB13</name>
              <description>Page 45 in Flash only accessible by privileged access</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB14</name>
              <description>Page 46 in Flash only accessible by privileged access</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB15</name>
              <description>Page 47 in Flash only accessible by privileged access</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB16</name>
              <description>Page 48 in Flash only accessible by privileged access</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB17</name>
              <description>Page 49 in Flash only accessible by privileged access</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB18</name>
              <description>Page 50 in Flash only accessible by privileged access</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB19</name>
              <description>Page 51 in Flash only accessible by privileged access</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB20</name>
              <description>Page 52 in Flash only accessible by privileged access</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB21</name>
              <description>Page 53 in Flash only accessible by privileged access</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB22</name>
              <description>Page 54 in Flash only accessible by privileged access</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB23</name>
              <description>Page 55 in Flash only accessible by privileged access</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB24</name>
              <description>Page 56 in Flash only accessible by privileged access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB25</name>
              <description>Page 57 in Flash only accessible by privileged access</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB26</name>
              <description>Page 58 in Flash only accessible by privileged access</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB27</name>
              <description>Page 59 in Flash only accessible by privileged access</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB28</name>
              <description>Page 60 in Flash only accessible by privileged access</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB29</name>
              <description>Page 61 in Flash only accessible by privileged access</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB30</name>
              <description>Page 62 in Flash only accessible by privileged access</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PRIVBB31</name>
              <description>Page 63 in Flash only accessible by privileged access</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
