modm-ext/data.modm.io/docs/svd/header_stm32wba52xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HASH</name>
      <description>HASH</description>
      <baseAddress>0x420c0400</baseAddress>
      <interrupt>
        <name>HASH</name>
        <description>HASH global interrupt</description>
        <value>61</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>HASH control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>INIT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATATYPE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBW</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DINNE</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MDMAT</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LKEY</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALGO</name>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIN</name>
          <description>HASH data input register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>STR</name>
          <description>HASH start register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NBLW</name>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>DCAL</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HR0</name>
          <description>HASH digest registers</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR1</name>
          <description>HASH digest registers</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR2</name>
          <description>HASH digest registers</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR3</name>
          <description>HASH digest registers</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HR4</name>
          <description>HASH digest registers</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>IMR</name>
          <description>HASH interrupt enable register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DINIE</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCIE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>HASH status register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DINIS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCIS</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAS</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BUSY</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBWP</name>
              <bitOffset>9</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DINNE</name>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NBWE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR0</name>
          <description>HASH context swap registers</description>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR1</name>
          <description>HASH context swap registers</description>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR2</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR3</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR4</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR5</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR6</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR7</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR8</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR9</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR10</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR11</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR12</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR13</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR14</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR15</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR16</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR17</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR18</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR19</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR20</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR21</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR22</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR23</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR24</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR25</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x15c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR26</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR27</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR28</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR29</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR30</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR31</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR32</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR33</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x17c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR34</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR35</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR36</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR37</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR38</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR39</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR40</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR41</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR42</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR43</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR44</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR45</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR46</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR47</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR48</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR49</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR50</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR51</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR52</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>CSR53</name>
          <description>HASH context swap registers</description>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DIGEST_HR0</name>
          <description>HASH digest registers</description>
          <addressOffset>0x310</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DIGEST_HR1</name>
          <description>HASH digest registers</description>
          <addressOffset>0x314</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DIGEST_HR2</name>
          <description>HASH digest registers</description>
          <addressOffset>0x318</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DIGEST_HR3</name>
          <description>HASH digest registers</description>
          <addressOffset>0x31c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DIGEST_HR4</name>
          <description>HASH digest registers</description>
          <addressOffset>0x320</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DIGEST_HR5</name>
          <description>HASH digest registers</description>
          <addressOffset>0x324</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DIGEST_HR6</name>
          <description>HASH digest registers</description>
          <addressOffset>0x328</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>DIGEST_HR7</name>
          <description>HASH digest registers</description>
          <addressOffset>0x32c</addressOffset>
          <size>0x20</size>
        </register>
